[{"fields": {"content": "<p class=\"bump\">Policymakers increasingly rely on computational models to predict the budgetary and broader economic impacts of current and proposed policies, especially those involving taxes and entitlements. Estimates from these models often determine a bill’s success or failure in the legislative process and public sphere.</p>\r\n\r\n<p class=\"bump\">The Open Source Policy Center's first focus is supporting community-driven projects that analyze the budgetary and broader economic impact of taxes. These models are completely transparent and freely available to researchers across the country. OSPC also provides an easy-to-use online interface that allows students, policymakers, journalists, and informed citizens to interact with the models and learn for themselves about the effects of policies.</p>\r\n", "slug": "about_bottom", "header": ""}, "pk": 1, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p class=\"bump\">The Open Source Policy Center is making policy analysis more transparent, trustworthy, and collaborative by supporting open-source projects that build cutting-edge economic models.</p>\r\n", "slug": "about_top", "header": ""}, "pk": 2, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p class=\"lead\">A LABORATORY FOR PREDICTING THE EFFECTS OF PUBLIC POLICY</p>", "slug": "home_top_overview", "header": ""}, "pk": 3, "model": "flatblocks.flatblock"}, {"fields": {"content": "<h2 class=\"h3\">Transparent</h2>", "slug": "home_left_subtitle", "header": ""}, "pk": 4, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>All of the projects we incubate are freely available and we encourage peer review. </p>", "slug": "home_left_blurb", "header": ""}, "pk": 5, "model": "flatblocks.flatblock"}, {"fields": {"content": "<h2 class=\"h3\">Accessible</h2>", "slug": "home_center_subtitle", "header": ""}, "pk": 6, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>You can run the models yourself through our webapp interface or by downloading the code and using it with your own data.</p> ", "slug": "home_center_blurb", "header": ""}, "pk": 7, "model": "flatblocks.flatblock"}, {"fields": {"content": "<h2 class=\"h3\">Collaborative</h2>", "slug": "home_right_subtitle", "header": ""}, "pk": 8, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>We welcome anyone, whether you are a modeler, software developer, economist, or policy analyst, to help improve and expand the suite of models.</p>", "slug": "home_right_blurb", "header": ""}, "pk": 9, "model": "flatblocks.flatblock"}, {"fields": {"content": "<a href=\"https://github.com/Open-source-economics\" target=\"_blank\">The code repository</a>", "slug": "home_left_link", "header": ""}, "pk": 10, "model": "flatblocks.flatblock"}, {"fields": {"content": "<a href=\"/taxbrain\">Our first web app</a>", "slug": "home_center_link", "header": ""}, "pk": 11, "model": "flatblocks.flatblock"}, {"fields": {"content": "<a href=\"http://taxcalc.readthedocs.org/en/latest/contributor_guide.html\" target=\"_blank\">Getting started guide</a>", "slug": "home_right_link", "header": ""}, "pk": 12, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p class=\"lead\">A simulator to analyze the budgetary impact of taxes.</p>", "slug": "home_taxbrain_subtitle", "header": ""}, "pk": 13, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>Over the coming months we will release many new features on TaxBrain. Sign up for our mailing list to learn more about the project.</p>", "slug": "home_taxbrain_blurb", "header": ""}, "pk": 14, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>We document the economics, data, and software behind our models.</p>", "slug": "home_contributor_left_blurb", "header": ""}, "pk": 15, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>All of our code is available on Github.com.</p>", "slug": "home_contributor_center_blurb", "header": ""}, "pk": 16, "model": "flatblocks.flatblock"}, {"fields": {"content": "<a href=\"http://taxcalc.readthedocs.org/en/latest/\" target = \"_blank\">View Documentation</a>", "slug": "home_contributor_left_link", "header": ""}, "pk": 17, "model": "flatblocks.flatblock"}, {"fields": {"content": "<a href=\"https://github.com/open-source-economics\">Visit Our Code Repositories</a>", "slug": "home_contributor_center_link", "header": ""}, "pk": 18, "model": "flatblocks.flatblock"}, {"fields": {"content": "<a href=\"http://taxcalc.readthedocs.org/en/latest/contributor_guide.html\" target=\"_blank\">Join the Modeling Community</a>", "slug": "home_contributor_right_link", "header": ""}, "pk": 19, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>Start with our getting started guide.</p>", "slug": "home_contributor_right_blurb", "header": ""}, "pk": 20, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>The Open Source Policy Center is dedicated to encouraging good policy by making policy analysis more transparent, accessible, and collaborative.</p>", "slug": "footer_blurb", "header": ""}, "pk": 21, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p class=\"lead\">A platform for accessing open-source tax models.</p>", "slug": "taxbrain_subheader", "header": ""}, "pk": 22, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p></p>", "slug": "taxbrain_exemptions_blurb", "header": ""}, "pk": 23, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p></p>", "slug": "taxbrain_standarddeduction_blurb", "header": ""}, "pk": 24, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "taxbrain_itemized_blurb", "header": ""}, "pk": 25, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "taxbrain_adjustments_blurb", "header": ""}, "pk": 26, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "taxbrain_socsec_blurb", "header": ""}, "pk": 27, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "taxbrain_credit_blurb", "header": ""}, "pk": 28, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "taxbrain_investment_taxes_blurb", "header": ""}, "pk": 29, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>Background information coming soon.</p>", "slug": "taxbrain_personal_blurb", "header": ""}, "pk": 30, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "taxbrain_amt_blurb", "header": ""}, "pk": 31, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>TaxBrain is an interface to <a href = \"//www.github.com/open-source-economics\" target=\"_blank\">open source economic models</a> for tax policy analysis. <a href = '//www.github.com/opensourcepolicycenter/webapp-public' target=\"_blank\">The code</a> for the TaxBrain webapp interface is itself open source. </p>\r\n\r\n<ul>\r\n<li> <strong>Step 1.</strong> Create a policy reform by modifying tax law parameters such as rates and deductions, adjust the economic baseline, and request the static result.</li>\r\n<li><strong>Step 2.</strong> Review your static output carefully. Ask questions.</li>\r\n<li><strong>Step 3.</strong> Choose a dynamic modeling approach. Because different approaches generally lead to different estimates, you may want to compare several approaches.</li>\r\n<li><strong>Step 4.</strong> Adjust economic assumptions and request the dynamic analysis.</li>\r\n<li><strong>Step 5.</strong> Review your dynamic output carefully. Ask questions.</li>\r\n<li><strong>Step 6.</strong> Share your results! The link to every results page is static and will never change. Send them around.</li>\r\n</ul>\r\n\r\n<p> Throughout this process, if you have a question about how to use TaxBrain or interpret the results, if you want to make a suggestion for making the interface or underlying models better, or if you discover a bug, please send a message to our mailing list, which you can join at <a href = '//list.ospc.org/mailman/listinfo/users_list.ospc.org' target=\"_blank\">list.ospc.org/mailman/listinfo/users_list.ospc.org</a>.</p>\r\n\r\n<p><strong>Disclaimer</strong>\r\n\r\n<p>Proper use of this tool and description of that use is ultimately your responsibility. If you plan on publishing your results, I highly recommend that you confirm with the community that you are using the tools properly and interpreting the results correctly before you publish them. If you have a compelling reason not to leave a public note on the mailing list, email me at matt.jensen@aei.org.</p>\r\n\r\n<p>Results will change as the underlying models improve. A fundamental reason for adopting open source methods in this project is to let people from all backgrounds contribute to the models that our society uses to assess economic policy; when community-contributed improvements are incorporated, the models will produce different results.</p>\r\n\r\n<p>Neither the Open Source Policy Center nor the American Enterprise Institute maintain institutional positions, and the results from models accessible via the TaxBrain interface should not be attributed directly to OSPC or AEI. A suggested acknowledgement is, \"We thank AEI for making TaxBrain available, but we bear sole responsibility for the use of the models and any conclusions drawn.\"</p>\r\n\r\n<p><strong> - Matt Jensen, managing director and founder of the Open Source Policy Center </strong></p>", "slug": "taxbrain_what_is_taxbrain_dropdown", "header": ""}, "pk": 32, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>A platform for accessing OSPC's open-source tax models.</p>", "slug": "taxbrain_footer", "header": ""}, "pk": 33, "model": "flatblocks.flatblock"}, {"fields": {"content": "<h3>User tips</h3>\r\n\r\n<p>Toggle the <strong>CPI</strong> control to indicate whether a parameter should be adjusted for inflation. </p> \r\n\r\n<p>Enter comma-separated values into a field to indicate the multiple years of tax law. \r\n<strong>DO NOT</strong> use commas as thousands separators. </p>\r\n\r\n\r\n\r\n", "slug": "taxbrain_get_started_blurb", "header": ""}, "pk": 34, "model": "flatblocks.flatblock"}, {"fields": {"content": "Distribution and Revenue Tables for Federal Individual Income Taxes", "slug": "taxbrain_results_header", "header": ""}, "pk": 35, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p><strong>Caution: this model is highly preliminary!</p></strong>\r\n<p>OG-USA is an open source economic dynamic general equilibrium model intended to evaluate U.S. tax policy.  The model code and detailed documentation is available at <a href = \"http://www.github.com/open-source-economics/OG-USA.\" target= \"_blank\">http://www.github.com/open-source-economics/OG-USA.</a></p> \r\n\r\n<p>OG-USA is an overlapping-generations model comprised of households, perfectly competitive firms, and a government with a balanced budget requirement. Firms make a static profit maximization decision in which they rent capital and hire labor to maximize profits given a Cobb-Douglas production function. The government levies taxes on individuals and makes lump sum transfers to individuals according to a balanced budget constraint. In the version deployed through TaxBrain, the model is scaled-down to have a single, representative household for each generation and simple tax functions. A detailed description of the model is available <a href = \"https://github.com/open-source-economics/OG-USA/blob/master/Model Writeup/OGUSA_TaxBrain_version.pdf\" target=\"blank\"> here.</a></p> \r\n\r\n<p>It is important to note a few caveats for OG-USA and the results available on TaxBrain:</p>\r\n\r\n<ol>\r\n<li>This is an initial release and there are almost certainly bugs to be worked out.  If you see anything that doesn’t make sense, please let us know by sending a message to the mailing list, which you can join at <a href = \"list.ospc.org/mailman/listinfo/users_list.ospc.org\" target = \"blank\"> list.ospc.org/mailman/listinfo/users_list.ospc.org.</a></li>\r\n<li>Solving the model requires that it attain a steady state.  One implication of this requirement is that the government’s budget constraint must be satisfied in the long run.  Therefore, the model must specify how tax cuts are financed.  The assumptions about how the budget is closed have substantial impact on the predictions of the model (see Table 2 of this JCT document).  In OG-USA, we specify a very simple government that contemporaneously redistributes all revenues in a lump-sum manner.  Tax cuts are financed by reducing these transfers.  Users should recognize that this assumption tends to provide an upper bound on the macroeconomic benefits of tax cuts, as other possible financing methods for tax cuts tend to yield smaller benefits. We are in the process of allowing users to alter the financing assumption.</li>\r\n<li>Because there is a representative household for each cohort, OG-USA cannot currently evaluate the distributional effects of tax policy within a cohort (although one could do intergenerational distributional analysis in this framework). We are in the process of adding heterogeneous households in each cohort.</li>\r\n<li>The production side of the model is very simplified. It does not allow the user to evaluate business taxation or interactions between personal and business taxation. We are in the process of expanding the production side of the model to allow for the evaluation of business taxation. </li>\r\n<li>The results are for a specific set of parameters values, which are outlined in our <a href = \"https://github.com/open-source-economics/OG-USA/blob/master/Model Writeup/OGUSA_TaxBrain_version.pdf\" target=\"blank\">detailed documentation.</a>  While we have tried to make reasonable parameterizations based on empirical analysis, some users might disagree with these values.  The ability to modify parameters through the web application is limited, but users who wish to consider adjustments may download the source code and do so.</li>\r\n</ol>\r\n\r\n<p>OG-USA interacts with Tax-Calculator, an open source economic microsimulation model available at <a href = \"www.github.com/open-source-economics/tax-calculator\" target= \"blank\"> www.github.com/open-source-economics/tax-calculator</a>.  It does so in the following way. The user enters changes to the individual income tax code he wishes to evaluate via the TaxBrain interface.  These tax policy parameters are then used to recompute marginal and effective tax rates for individuals in the microdata underlying Tax-Calculator.  These marginal and effective tax rates are then use to estimate marginal and effective tax rates faced by the households in OG-USA, thereby determining how model households respond to changes in tax policy.</p>\r\n\r\n<p><strong>How to cite</strong></p>\r\n\r\n<p>These results were generated with the community developed and open source economic model OG-USA, accessed via version xx.xx.xx of TaxBrain, an interface hosted by AEI's Open Source Policy Center. The exact simulation modeled here is available at www.ospc.org/taxbrain/dynamic/results/NNNNNN. The results are solely the responsibility of the author.</p>\r\n\r\n<p><strong> \r\nProject Maintainers (OG-USA modeling)*:\r\n<ul style = \"list-style-type:none\">\r\n<li>- <a href = \"http://mtweb.mtsu.edu/jdebacker/\" target = \"blank\" >Jason DeBacker**</a></li> \r\n<li>- <a href = \"https://sites.google.com/site/rickecon/\" target = \"blank\" >Rick Evans**</a></li>\r\n</ul>\r\n</strong></p> \r\n<p>*These members review open source contributions for the OG-USA modeling effort.\r\n\r\n<p>**The contact information for Professors DeBacker and Evans will be updated in the coming months to reflect their new positions at the University of South Carolina and University of Chicago, respectively.</p>\r\n", "slug": "dynamic_get_started_blurb", "header": ""}, "pk": 36, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>In the context of policy analysis, dynamic modeling incorporates behavior that affects the aggregate output of the economy. This broad definition includes nearly every type of economic analysis except for the approach most often used in the analysis of tax and spending policy proposals by agencies in the federal government. </p>\r\n\r\n<p> There is no single \"accepted\" way to estimate the dynamic effects of policy reforms, so TaxBrain is designed to encourage users to try several approaches and to grapple seriously with the limitations and tradeoffs of each approach. Please pay close attention to the descriptions of each model and send a message to the TaxBrain community mailing list if you have questions. You can join the mailing list at <a href = '//list.ospc.org/mailman/listinfo/users_list.ospc.org' target=\"_blank\">list.ospc.org/mailman/listinfo/users_list.ospc.org</a>. </p>\r\n\r\n<p>The open source project maintainers are working hard to expand the capabilities of these models and would appreciate a hand if there are limitations that frustrate you. </p>\r\n\r\n<p> Finally, if you are an economist with a dynamic model that you would like to make available on TaxBrain, please write to the mailing list or to me at matt.jensen@aei.org.</p>\r\n\r\n<p><strong>- Matt Jensen,  managing director and founder of the Open Source Policy Center </strong></p>\r\n\r\n", "slug": "dynamic_landing_blurb", "header": ""}, "pk": 37, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>The partial equilibrium (PE) model answers the question \"How would taxpayer behavior (income and deductions) influence the estimate if all other prices in the economy could stay the same?\"  It relies on estimates of the elasticity of taxable income with respect to tax policy and is useful for summarizing the power and direction of a reform's effect on the economy.</p>\r\n\r\n<p>The actual effects of a tax policy would generally differ from that predicted by the PE model in a manner that depends on other elasticities and legislative changes. In particular the elasticity of demand for labor, deductible goods, savings, investment, monetary policy, and other factors will moderate the outcome. Because the PE model does not include those effects, it is not a reliable estimate of a tax policy's full effects.</p>\r\n\r\n<p> John Creedy's <a href=\"http://www.victoria.ac.nz/sacl/centres-and-institutes/cagtr/twg/publications/5-the-elasticity-of-taxable-income-johncreedy.pdf\" target=\"_blank\"> \"The Elasticity of Taxable Income: A Non-Technical Summary\" </a> shows how to use the PE behavioral responses for determining the efficiency effect of a tax reform. In <a href=\"http://www.nber.org/papers/w15012\" target=\"_blank\"> \"The Elasticity of Taxable Income with Respect to Marginal Tax Rates: A Critical Review,\" </a> Saez, Slemrod and Giertz review various  estimates of the critical parameters. The Joint Committee on Taxation (JCT) and Congressional Budget Office (CBO) estimate the persistent capital gains elasticity in their <a href=\"https://www.jct.gov/publications.html?func=startdown&id=4472\" target=\"_blank\"> \"New Evidence on the Tax Elasticity of Capital Gains\".</a></p>\r\n\r\n<p>The PE approach is similar to the \"conventional\" modeling conducted by government agencies for the budgeting process in that both approaches allow for taxpayers to change their behavior in response to policy reforms. The difference is that the PE model allows those behavioral changes to influence Gross National Product (GNP), whereas JCT and the Office of Tax Analysis (OTA) at the Treasury Department hold GNP fixed.</p>\r\n\r\n<p> The PE model is implemented by applying the behavioral elasticities at the individual taxpayer level. The source code for the implementation is available in the <a href = \"https://github.com/open-source-economics/Tax-Calculator/blob/master/taxcalc/behavior.py\" target=\"_blank\"> behavior module </a> of the open source <a href = \"https://github.com/open-source-economics/Tax-Calculator/\" target=\"_blank\"> Tax-Calculator model</a> . \r\n</p>\r\n\r\n\r\n<p><strong> \r\nCore Maintainers (PE modeling)*:\r\n<ul style = \"list-style-type:none\">\r\n<li>- <a href = \"http://www.nber.org/people/daniel_feenberg\" target = \"blank\" >Dan Feenberg, NBER</a></li> \r\n<li>- <a href = \"https://www.aei.org/scholar/matthew-h-jensen/\" target = \"blank\" >Matt Jensen, AEI</a></li> \r\n<li>- <a href = \"https://github.com/Amy-Xu\" target = \"blank\" >Amy Xu, AEI</a></li> \r\n</ul>\r\n</strong></p> \r\n\r\n<p>*These members review open source contributions to the sections of the Tax-Calculator repository relevant to PE modeling. </p>", "slug": "dynamic_behavior_get_started_blurb", "header": ""}, "pk": 38, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>This approach answers the question, \"how would taxpayer behavior (income and deductions) affect revenue if all other prices in the economy could stay the same?\" <p>", "slug": "dynamic_behavioral_blurb", "header": ""}, "pk": 39, "model": "flatblocks.flatblock"}, {"fields": {"content": "", "slug": "elastic_dynamic_subheader", "header": ""}, "pk": 40, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>This approach harnesses econometric estimates of the historical relationship between tax policy and the macroeconomy to predict the effect of tax reforms on growth.</p>", "slug": "dynamic_macro_el_blurb", "header": ""}, "pk": 41, "model": "flatblocks.flatblock"}, {"fields": {"content": "<h1> What is TaxBrain? </h1>\r\n<p>TaxBrain is an interface to <a href = \"//www.github.com/open-source-economics\" target=\"_blank\">open source economic models</a> for tax policy analysis. <a href = '//www.github.com/opensourcepolicycenter/webapp-public' target=\"_blank\">The code</a> for the TaxBrain webapp interface is itself open source. </p>\r\n\r\n<ul>\r\n<li> <strong>Step 1.</strong> Create a policy reform by modifying tax law parameters such as rates and deductions, adjust the economic baseline, and request the static result.</li>\r\n<li><strong>Step 2.</strong> Review your static output carefully. Ask questions.</li>\r\n<li><strong>Step 3.</strong> Choose a dynamic modeling approach. Because different approaches generally lead to different estimates, you may want to compare several approaches.</li>\r\n<li><strong>Step 4.</strong> Adjust economic assumptions and request the dynamic analysis.</li>\r\n<li><strong>Step 5.</strong> Review your dynamic output carefully. Ask questions.</li>\r\n<li><strong>Step 6.</strong> Share your results! The link to every results page is static and will never change. Send them around.</li>\r\n</ul>\r\n\r\n<p> Throughout this process, if you have a question about how to use TaxBrain or interpret the results, if you want to make a suggestion for making the interface or underlying models better, or if you discover a bug, please send a message to our mailing list, which you can join at <a href = '//list.ospc.org/mailman/listinfo/users_list.ospc.org' target=\"_blank\">list.ospc.org/mailman/listinfo/users_list.ospc.org</a>.</p>\r\n\r\n<p><strong>Disclaimer</strong>\r\n\r\n<p>Proper use of this tool and description of that use is ultimately your responsibility. If you plan on publishing your results, I highly recommend that you confirm with the community that you are using the tools properly and interpreting the results correctly before you publish them. If you have a compelling reason not to leave a public note on the mailing list, email me at matt.jensen@aei.org.</p>\r\n\r\n<p>Results will change as the underlying models improve. A fundamental reason for adopting open source methods in this project is to let people from all backgrounds contribute to the models that our society uses to assess economic policy; when community-contributed improvements are incorporated, the models will produce different results.</p>\r\n\r\n<p>Neither the Open Source Policy Center nor the American Enterprise Institute maintain institutional positions, and the results from models accessible via the TaxBrain interface should not be attributed directly to OSPC or AEI. A suggested acknowledgement is, \"We thank AEI for making TaxBrain available, but we bear sole responsibility for the use of the models and any conclusions drawn.\"</p>\r\n\r\n<p><strong> - Matt Jensen, managing director and founder of the Open Source Policy Center </strong></p> \r\n\r\n<hr>\r\n\r\n<h1>Static modeling (Step 1)</h1>\r\n\r\n<p> Static tax analysis entails computing individuals' tax changes under the assumption that behavior does not change in response to tax policy. Static analyses are useful for understanding the mechanistic effects of tax policy changes, and they form the basis to which behavior is applied for dynamic analyses. \r\n\r\n<p>TaxBrain's static modeling capabilities rely on several open source economic models and other packages:</p> \r\n<ul>\r\n<li> <a href = \"//www.github.com/open-source-economics/tax-calculator\" target=\"_blank\">Tax-Calculator</a> computes federal individual income taxes and Federal Insurance Contribution Act(FICA) taxes for a sample of tax filing units in years beginning with 2013 .</li>\r\n<li><a href = '//www.github.com/open-source-economics/taxdata' target=\"_blank\">TaxData</a> creates a microdataset that closely reproduces the multivariate distribution of income, deduction and credit items in 2009, extrapolated to 2015-2026 levels in accordance with Congressional Budget Office forecasts available in spring 2016. It is intended to match similar but confidential data used by the Congressional Joint Committee on Taxation. The underlying dataset must be purchased from the Statistics of Income division of the Internal Revenue Service. Additional information on non-filers is taken from the March 2013 Current Population Survey. </li>\r\n<li> DropQ implements a disclosure avoidance algorithm initially proposed by the U.S. Census Bureau to protect confidential data from differencing attacks. The code is undergoing security review before it is open sourced.</li>\r\n<li> <a href = '//www.github.com/opensourcepolicycenter/webapp-public' target=\"_blank\">TaxBrain</a> itself is an open source project. The underlying models are deployed to TaxBrain using conda, a free and open source package management system supported by <a href = '//www.continuum.io' target=\"_blank\">Continuum Analytics</a></li>\r\n</ul>\r\n\r\n<p><strong>Transparency and Replicability</strong></p>\r\n\r\n<p>In addition to relying on open source models, we are devoted to making it easy for reviewers to understand the models even if they can't understand the source code or don't have access to the underlying data. Toward that end we produce several additional reports to enhance transparency, peer review, collaboration and a scientific advancement.</p>\r\n\r\n<p>Note that these reports currently rely on the latest versions of tax-calculator and TaxData, which might not correspond perfectly to TaxBrain.</p>\r\n\r\n<ul>\r\n<li><a href = \"https://github.com/open-source-economics/Tax-Calculator/blob/master/taxcalc/comparison/reform_results.txt\" target = \"_blank\">Federal income tax and FICA liability deltas for example reforms</a></li>\r\n<li>Dummy datasets and associated Tax-Calculator results (Coming soon)</li> \r\n<li><a href = \"https://github.com/open-source-economics/Tax-Calculator/blob/master/taxcalc/comparison/variable_stats_summary.csv\">Basic summary statistics for variables used in Tax-Calculator and major intermediate results (2013-2026) </a></li>Currently only weighted mean is available, more statistics will be  added shortly.\r\n<li><a href = \"https://github.com/open-source-economics/Tax-Calculator/blob/master/taxcalc/comparison/correlation.csv\" target= \"_blank\">Correlation matrix for the same set of variables</a> 2016 available now, other years coming soon.</li>\r\n<li>Extrapolation related: <br>\r\n<a href = \"https://github.com/open-source-economics/taxdata/blob/master/Stage%20II/Stage_I_factors.csv\" target= \"_blank\">Blow-up factors</a><br>\r\n<a href = \"https://github.com/open-source-economics/taxdata/blob/master/Stage%20II/Stage_II_targets.csv\" target= \"_blank\">Aggregate and distributional targets</a></li> \r\n<li>Equations and coefficients for imputations (Coming soon)</li>\r\n</ul>\r\n\r\n<p><strong>Accuracy notes</strong></p>\r\n\r\n<p>The Python code that performs the tax calculations has been validated in a\r\nnumber of ways.  First, Tax-Calculator results for a number of tax filing\r\nunits have been compared to hand calculations performed using IRS tax\r\nforms.  Second, Tax-Calculator results for a large sample of tax filing units\r\nhave been compared to results for the same sample generated by a\r\n<a href = '//www.nber.org/taxcalc' target=\"_blank\">detailed SAS program</a> developed by Dan\r\nFeenberg and Ina Shapiro of NBER.  Third, a subset of input variables has been used to compare the results of Tax-Calculator to <a href = '//users.nber.org/~taxsim' target=\"_blank\">Internet TAXSIM</a> as well as against the Policy Simulation Group's <a href = '//www.polsim.com/inctax-caps.html' target=\"_blank\">PENSIM tax module</a></p>\r\n\r\n<p> Bugs aside, the results from TaxBrain might differ in comparison to those produced by Congress or the Administration for other reasons. Modeling requires many assumptions, and neither Congress nor the executive branch publicize all of their assumptions. For example, the distribution of wages in <a href = '//www.github.com/open-source-economics/taxdata' target=\"_blank\">TaxData</a> is assumed to stay the same in real terms for all years after the last year we have available data (2013). We know that Congress assumes this distribution changes over time, but it doesn't publish by how much. These assumptions are all flexible in <a href = '//www.github.com/open-source-economics/taxdata' target=\"_blank\">TaxData</a>, so please conduct sensitivity analyses. Other assumptions can be made flexible in TaxBrain based on user requests.</p>\r\n\r\n<p><strong> \r\nCore Maintainers (static modeling)*:\r\n<ul style = \"list-style-type:none\">\r\n<li>- <a href = \"https://www.continuum.io/content/tj-alumbaugh\" target = \"blank\" >T.J. Alumbaugh, Continuum Analytics</a></li> \r\n<li>- <a href = \"http://www.nber.org/people/daniel_feenberg\" target = \"blank\" >Dan Feenberg, National Bureau of Economic Research</a></li> \r\n<li>- <a href = \"http://www.polsim.com/MRH_vita.pdf\" target = \"blank\" >Martin Holmer, Policy Simulation Group</a></li> \r\n<li>- <a href = \"https://www.aei.org/scholar/matthew-h-jensen/\" target = \"blank\" >Matt Jensen, American Enterprise Institute</a></li> \r\n<li>- <a href = \"http://quantria.com/#team\" target = \"blank\" >John O'Hare, Quantria Strategies</a></li> \r\n<li>- <a href = \"https://github.com/Amy-Xu\" target = \"blank\" >Amy Xu, American Enterprise Institute</a></li> \r\n</ul>\r\n</strong></p> \r\n<p> These members have \"write access\" to one or both of the core static modeling repositories, Tax-Calculator and TaxData, and work as a team to determine which open source contributions are accepted.</p>", "slug": "taxbrain_above_get_started_blurb", "header": ""}, "pk": 42, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>This approach harnesses econometric estimates of the historic relationship between tax policy and the macroeconomy to predict the effect of tax reforms on growth.</p> \r\n\r\n<p>In particular, this model relies on estimates of how GDP responds to changes in the average after tax rate on wage income across all taxpayers (one minus the average marginal tax rate, or 1 - AMTR). These estimates are derived from calculations of income-weighted marginal tax rates under the baseline and reform using Tax-Calculator with baseline data from TaxData. An example of the implementation is available <a href = \"https://github.com/open-source-economics/Tax-Calculator/blob/master/taxcalc/macro_elasticity.py\" target = \"blank\">here.</a></p>\r\n\r\n<p> Evidence for this parameter can be found in Barro and Redlick's <a href = //qje.oxfordjournals.org/content/126/1/51.abstract target=\"_blank\"> \"Macroeconomic Effects from Government Purchases and Taxes.\" </a> In particular, Barro and Redlick find that a 1 percentage point increase in the AMTR leads to a 0.54 percent increase in GDP. Evaluated at the sample mean, this translates to an elasticity of GDP with respect to the average after tax rate of 0.36. </p>\r\n\r\n<p>Karel Mertens' <a href = \"//mertens.economics.cornell.edu/papers/MTRI_september2015.pdf\" target = \"_blank\">\"Marginal Tax Rates and Income: New Time Series Evidence\" </a> contains additional evidence, focused on tax cuts affecting the upper part of the income distribution.</p>\r\n\r\n<p>Both Mertens and Karel tentatively conclude that the effect stems from marginal rather than average tax rates.</p> \r\n\r\n\r\n<p><strong> \r\nCore Maintainer (Macro elasticity modeling)*:\r\n<ul style = \"list-style-type:none\">\r\n<li>- <a href = \"https://www.aei.org/scholar/matthew-h-jensen/\" target = \"blank\" >Matt Jensen, AEI</a></li> \r\n</ul>\r\n</strong></p> \r\n\r\n*This member reviews open source contributions relevant to the macro elasticity modeling portions of the Tax-Calculator repository. ", "slug": "dynamic_elasticity_get_started_blurb", "header": ""}, "pk": 43, "model": "flatblocks.flatblock"}, {"fields": {"content": "<p>This approach answers the question, \"how does tax policy affect macroeconomic aggregates and prices?\"", "slug": "dynamic_olg_blurb", "header": ""}, "pk": 44, "model": "flatblocks.flatblock"}]